# В данном файле размещаются дополнительные переводы.
# Используется для таких случаев, как: дополнительные кнопки меню, названия планов и т.п.

# Чтобы использовать переводы, указывайте ключ вместо текста (например, в названии плана).
# Ключи должны быть уникальными. # Подробная документация по переводам: assets/README.md.

# Максимальная длина перевода:
# Для использования в кнопках - 16 символов.
# Для использования в сообщениях - 1024 символа.

# пример-ключа = перевод

c-menu-link1 = 1️⃣ Первая кнопка
c-menu-link2 = 2️⃣ Вторая кнопка

c-plan-name1 = 1️⃣ Первый план
c-plan-name2 = 2️⃣ Второй план